
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОписаниеПеременных


#КонецОбласти

#Область ПрограммныйИнтерфейс

// Код процедур и функций

#КонецОбласти

#Область ОбработчикиСобытий

Процедура ОбработкаПроведения(Отказ, Режим)
	
	
	Если НАШ_Согласовано = Ложь Тогда 
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст = "Документ не согласован.Проведение невозможно.Без согласования документ можно только записать";
		Сообщение.Сообщить();		
		Отказ = Истина;
	КонецЕсли;
	
	Движения.НАШ_СкидкиКонтрагенты.Записывать = Истина;
	Для Каждого Строка Из НАШ_Скидки Цикл
		Движение = Движения.НАШ_СкидкиКонтрагенты.Добавить();
		Движение.Период = Дата;
		Движение.Контрагент = Строка.НАШ_Контрагент;
		Движение.Скидка = Строка.НАШ_Скидка;
	КонецЦикла;
	
КонецПроцедуры


#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Код процедур и функций

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Код процедур и функций

#КонецОбласти

#Область Инициализация

#КонецОбласти

#КонецЕсли
