# Область СлужебныеПроцедурыИФункции
	Процедура ДополнитьФорму(Форма) Экспорт	
	ИмяФормы = Форма.ИмяФормы;
	Если
		ИмяФормы = "Документ.ОплатаОтПокупателя.Форма.ФормаДокумента" Тогда
		ВставитьПолеКонтактноеЛицоПередПолеСуммаДокумента(Форма);
	ИначеЕсли 	
		ИмяФормы = "Документ.ОплатаПоставщику.Форма.ФормаДокумента" Тогда
		ВставитьПолеКонтактноеЛицоПередПолеСуммаДокумента(Форма);
	ИначеЕсли 	
		ИмяФормы = "Документ.ПоступлениеТоваровУслуг.Форма.ФормаДокумента" Тогда 
		ДобавитьПолеКонтактноеЛицоВГруппуШапкаПраво(Форма);
	ИначеЕсли 	
		ИмяФормы = "Документ.РеализацияТоваровУслуг.Форма.ФормаДокумента" Тогда
		ДобавитьПолеКонтактноеЛицоВГруппуШапкаПраво(Форма); 
	ИначеЕсли 	
		ИмяФормы = "Документ.ЗаказПокупателя.Форма.ФормаДокумента" Тогда
		ДобавитьПолеКонтактноеЛицоВГруппуШапкаПраво(Форма);
	КонецЕсли;  
КонецПроцедуры

Процедура ВставитьПолеКонтактноеЛицоПередПолеСуммаДокумента(Форма) Экспорт 
	
		НовыйЭлемент = Форма.Элементы.Вставить("НАШ_КонтактноеЛицо", Тип("ПолеФормы"),,Форма.Элементы.СуммаДокумента); 
		НовыйЭлемент.Заголовок = "Контактное лицо";
        НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
		НовыйЭлемент.ПутьКДанным = "Объект.НАШ_КонтактноеЛицо";

КонецПроцедуры	
	
Процедура ДобавитьПолеКонтактноеЛицоВГруппуШапкаПраво(Форма) Экспорт 
		
		НовыйЭлемент = Форма.Элементы.Добавить("НАШ_КонтактноеЛицо", Тип("ПолеФормы"),Форма.Элементы.ГруппаШапкаПраво); 
		НовыйЭлемент.Заголовок = "Контактное лицо";
        НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
		НовыйЭлемент.ПутьКДанным = "Объект.НАШ_КонтактноеЛицо"; 
		
КонецПроцедуры    
	
Процедура ДобавляемыеРеквизитыФормыЗаказПокупателя(Форма) Экспорт
	
	Перем ДобавляемыеРеквизиты, ТипЧисло, ТипБулево,РеквизитСкидка, РеквизитСкидкаЕсть;
	
	ДобавляемыеРеквизиты = Новый Массив; 
	ТипЧисло = Новый ОписаниеТипов("Число",Новый КвалификаторыЧисла(5,3)); 
	РеквизитСкидка = Новый РеквизитФормы("НАШ_СогласованнаяСкидка",ТипЧисло,,"НАШ_СогласованнаяСкидка");
	ДобавляемыеРеквизиты.Добавить(РеквизитСкидка);
	
	ТипБулево = Новый ОписаниеТипов("Булево"); 
	РеквизитСкидкаЕсть = Новый РеквизитФормы("НАШ_СкидкаПрименена",ТипБулево,,"НАШ_СкидкаПрименена");
	ДобавляемыеРеквизиты.Добавить(РеквизитСкидкаЕсть); 
	Форма.ИзменитьРеквизиты(ДобавляемыеРеквизиты);

КонецПроцедуры
# КонецОбласти
